MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.h
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_lptim.h
  * @brief   Header file of LPTIM HAL module.
  **********************************************************************************************************************
    * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5XX_HAL_LPTIM_H
#define STM32C5XX_HAL_LPTIM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"
#include "stm32c5xx_ll_lptim.h"

/** @addtogroup STM32C5xx_HAL_Driver
  *  @{
  */
#if defined (LPTIM1)

/** @defgroup LPTIM LPTIM
  *  @{
  */

/* Private constants -------------------------------------------------------------------------------------------------*/
/** @addtogroup LPTIM_Private_Constants
  *  @{
  */

/**
  * @brief Maximum number of channels.
  */
#define HAL_LPTIM_CHANNELS 2U

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
/**
  * @brief Maximum number of DMA requests.
  */
#define LPTIM_DMA_REQUESTS 3U

/** DMA active without silent mode. */
#define LPTIM_ACTIVE_NOT_SILENT (0U)

/** DMA active in silent mode.      */
#define LPTIM_ACTIVE_SILENT     (1U)

#endif /* USE_HAL_LPTIM_DMA */

/**
  * @}
  */

/* Exported constants ------------------------------------------------------------------------------------------------*/

/** @defgroup LPTIM_Exported_Constants HAL LPTIM Constants
  *  @{
  */

#if defined (USE_HAL_LPTIM_GET_LAST_ERRORS) && (USE_HAL_LPTIM_GET_LAST_ERRORS == 1)
/** @defgroup  LPTIM_Error_Code Error Code definition reflecting the processes
  * asynchronous errors
  * @{
  */

/** No error                                                      */
#define  HAL_LPTIM_ERROR_NONE      (0UL)

/** DMA transfer error                                            */
#define  HAL_LPTIM_ERROR_DMA       (1UL << 0)

/** Timeout on the write operation in register (CCRx, ARR, DIER, REPOK). */
#define  HAL_LPTIM_ERROR_TIMEOUT   (1UL << 1)

/**
  * @}
  */
#endif /* USE_HAL_LPTIM_GET_LAST_ERRORS */

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
/** disable DMA interrupt */
#define HAL_LPTIM_OPT_DMA_IT_NONE   HAL_DMA_OPT_IT_NONE
/** enable half transfer interrupt */
#define HAL_LPTIM_OPT_DMA_IT_HT   HAL_DMA_OPT_IT_HT
/** enable ALL DMA interrupts */
#define HAL_LPTIM_OPT_DMA_IT_DEFAULT    HAL_DMA_OPT_IT_DEFAULT
/** all optional DMA interrupts disable */
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#define HAL_LPTIM_OPT_DMA_IT_SILENT HAL_DMA_OPT_IT_SILENT
#endif /* USE_HAL_DMA_LINKEDLIST */

#endif /* USE_HAL_LPTIM_DMA */
/**
  * @}
  */
/* End of exported constants -----------------------------------------------------------------------------------------*/

/* Exported types ----------------------------------------------------------------------------------------------------*/
/** @defgroup LPTIM_Exported_Types HAL LPTIM Types
  *  @{
  */

/** @defgroup LPTIM_Exported_Types_Group1 Enumerations
  * @{
 */

/**
  * @brief HAL LPTIM instance.
  */
typedef enum
{
  /** LPTIM1 */
  HAL_LPTIM1 = LPTIM1_BASE,

} hal_lptim_t;


/**
  * @brief  HAL LPTIM Global States definition.
  */
typedef enum
{
  /** Peripheral not yet initialized                     */
  HAL_LPTIM_STATE_RESET   = 0UL,

  /** Peripheral initialized but not yet configured      */
  HAL_LPTIM_STATE_INIT    = (1UL << 31U),

  /** Peripheral initialized and a global config applied */
  HAL_LPTIM_STATE_IDLE    = (1UL << 30U),

  /** Counter is running */
  HAL_LPTIM_STATE_ACTIVE  = (1UL << 29U),

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
  /** Counter is running with Silent DMA mode */
  HAL_LPTIM_STATE_ACTIVE_SILENT = (HAL_LPTIM_STATE_ACTIVE | LPTIM_ACTIVE_SILENT),
#endif /* USE_HAL_LPTIM_DMA */
} hal_lptim_state_t;


/**
  * @brief  LPTIM Channel States definition.
  */
typedef enum
{
  /** LPTIM Channel initial state                                */
  HAL_LPTIM_CHANNEL_STATE_RESET       = (1UL << 31U),

  /** LPTIM Channel ready for use as output channel              */
  HAL_LPTIM_OC_CHANNEL_STATE_IDLE     = (1UL << 30U),

  /** An internal process is ongoing on the LPTIM output channel */
  HAL_LPTIM_OC_CHANNEL_STATE_ACTIVE   = (1UL << 29U),

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
  /** An internal process is ongoing on the LPTIM output channel in DMA silent mode. */
  HAL_LPTIM_OC_CHANNEL_STATE_ACTIVE_SILENT = (HAL_LPTIM_OC_CHANNEL_STATE_ACTIVE |
                                              LPTIM_ACTIVE_SILENT),
#endif /* USE_HAL_LPTIM_DMA */

  /** LPTIM Channel ready for use as input channel               */
  HAL_LPTIM_IC_CHANNEL_STATE_IDLE     = (1UL << 28U),

  /** An internal process is ongoing on the LPTIM input channel */
  HAL_LPTIM_IC_CHANNEL_STATE_ACTIVE   = (1UL << 27U),

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
  /** An internal process is ongoing on the LPTIM input channel in DMA silent mode. */
  HAL_LPTIM_IC_CHANNEL_STATE_ACTIVE_SILENT = (HAL_LPTIM_IC_CHANNEL_STATE_ACTIVE |
                                              LPTIM_ACTIVE_SILENT),
#endif /* USE_HAL_LPTIM_DMA */
} hal_lptim_channel_state_t;

/**
  * @brief  HAL LPTIM Channels identifier definition.
  */
typedef enum
{
  /** LP Timer input/output channel 1         */
  HAL_LPTIM_CHANNEL_1   = LL_LPTIM_CHANNEL_CH1,

  /** LP Timer input/output channel 2         */
  HAL_LPTIM_CHANNEL_2   = LL_LPTIM_CHANNEL_CH2,

} hal_lptim_channel_t;

/**
  * @brief  HAL LPTIM Counter Mode Configuration.
  * The counter mode configuration lets us select how the counter is started and reset.
  *     - The counter can be in continuous counting mode or in one-shot
  *       counting mode, which defines how the counter is started.
  *
  *         - Continuous mode: the timer is free-running. The timer is
  *           started from a trigger event and never stops until the timer
  *           is disabled.
  *           This mode is further divided in two submodes:
  *           - regular: a trigger event starts the counter, and a subsequent
  *                      external trigger event is discarded.
  *           - Timeout: the first trigger event starts the timer,
  *                      any successive trigger event resets the LPTIM
  *                      counter and the repetition counter and the timer
  *                      restarts.
  *
  *         - One-shot mode: the timer starts from a trigger event and
  *           stops when an LPTIM update event is generated.
  *           This mode is further divided in two submodes:
  *           - regular: the counter is stopped on an update event once the
  *                      repetition counter is 0. Then, a subsequent trigger
  *                      starts a new one-shot counting cycle.
  *           - Set-once: the counter is only started once following the
  *                       first trigger, and any subsequent trigger event is
  *                       discarded.
  * @note The waveform on an output channel depends on the counter mode.
  *        In one-shot mode, the output waveform is a PWM signal for the
  *        duration of the one-shot cycle (that is a pulse waveform, where
  *        the number of pulses generated depends on the repetition counter).
  *        In set-once mode, there is only one one-shot cycle.
  *        At the end of the counting period, the output level is frozen according to the configured polarity.
  *        To obtain a typical (continuous) PWM signal on an output channel,
  *        the continuous counting mode must be selected.
  */
typedef enum
{
  /** One-shot.
    When the counter is stopped, a trigger event starts it.
    The counter is stopped on an update event. */
  HAL_LPTIM_ONE_SHOT   = LL_LPTIM_OPERATING_MODE_ONESHOT,

