MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.h
  /** Set-once.
    A first trigger event starts the counter for a single
    one-shot cycle. */
  HAL_LPTIM_SET_ONCE   = (LL_LPTIM_OPERATING_MODE_ONESHOT |
                          LL_LPTIM_OC_WAVEFORM_SETONCE),

  /** Continuous.
      The timer is started from a trigger event and never stops
      until it is disabled. */
  HAL_LPTIM_CONTINUOUS = LL_LPTIM_OPERATING_MODE_CONTINUOUS,

  /** Timeout.
      Similar to 'Continuous' mode, except that any new trigger after the start
      resets the counter.
      @note The value for the timeout is set using
            HAL_LPTIM_OC_SetConfigChannel() or
            HAL_LPTIM_OC_SetChannelPulse(). */
  HAL_LPTIM_TIMEOUT    = (LL_LPTIM_OPERATING_MODE_CONTINUOUS |
                          LL_LPTIM_TIMEOUT_ENABLE),

} hal_lptim_mode_t;

/**
  * @brief HAL LPTIM input channel sources.
  */
typedef enum
{
  /** connected to GPIO */
  HAL_LPTIM_INPUT_GPIO,

  /** connected to LSI */
  HAL_LPTIM_INPUT_LSI,

  /** connected to LSE */
  HAL_LPTIM_INPUT_LSE,

  /** connected to COMP1 */
  HAL_LPTIM_INPUT_COMP1_OUT,

  /** connected to MCO1 */
  HAL_LPTIM_INPUT_MCO1,

  /** connected to RCC_HSE_1MHZ */
  HAL_LPTIM_INPUT_RCC_HSE_1MHZ,

  /** connected to Eventout */
  HAL_LPTIM_INPUT_EVENTOUT,

} hal_lptim_ic_src_t;


/**
  * @brief HAL LPTIM Clock Source Prescaler definition.
  * @note  In encoder mode the prescaler division factor must be set to 1.
  */
typedef enum
{
  /** Prescaler division factor is set to 1            */
  HAL_LPTIM_CLK_SRC_DIV1   = LL_LPTIM_PRESCALER_DIV1,

  /** Prescaler division factor is set to 2            */
  HAL_LPTIM_CLK_SRC_DIV2   = LL_LPTIM_PRESCALER_DIV2,

  /** Prescaler division factor is set to 4            */
  HAL_LPTIM_CLK_SRC_DIV4   = LL_LPTIM_PRESCALER_DIV4,

  /** Prescaler division factor is set to 8            */
  HAL_LPTIM_CLK_SRC_DIV8   = LL_LPTIM_PRESCALER_DIV8,

  /** Prescaler division factor is set to 16           */
  HAL_LPTIM_CLK_SRC_DIV16  = LL_LPTIM_PRESCALER_DIV16,

  /** Prescaler division factor is set to 32           */
  HAL_LPTIM_CLK_SRC_DIV32  = LL_LPTIM_PRESCALER_DIV32,

  /** Prescaler division factor is set to 64           */
  HAL_LPTIM_CLK_SRC_DIV64  = LL_LPTIM_PRESCALER_DIV64,

  /** Prescaler division factor is set to 128          */
  HAL_LPTIM_CLK_SRC_DIV128 = LL_LPTIM_PRESCALER_DIV128,

} hal_lptim_clk_src_presc_t;


/**
  * @brief HAL LPTIM Input1 (IN1) Polarity definition.
  *        When LPTIM_IN1 is used as an external clock source (HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS or
  *        HAL_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS), the active edge of the signal can be selected.
  * @note  For encoder mode the polarity of Input1 is configured by selecting
  *        the encoder submode (HAL_LPTIM_CLK_ENCODER_SUBMODE_[1|2|3]).
  * @note  If both edges are configured to be active, an internal clock
  *        signal must also be provided.
  */
typedef enum
{
  /** The rising edge is the active edge used for counting            */
  HAL_LPTIM_INPUT1_RISING         = LL_LPTIM_CLK_POLARITY_RISING,

  /** The falling edge is the active edge used for counting           */
  HAL_LPTIM_INPUT1_FALLING        = LL_LPTIM_CLK_POLARITY_FALLING,

  /** Both edges are active edges.
      This is valid only if an internal clock is provided. That is, the clock
      source is HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS.
      The internal clock signal frequency must be at least four times higher
      than the external clock signal frequency. */
  HAL_LPTIM_INPUT1_RISING_FALLING = LL_LPTIM_CLK_POLARITY_RISING_FALLING,

} hal_lptim_input1_polarity_t;

/**
  * @brief HAL LPTIM Input1 source definition. \n
  *        When LPTIM is clocked by an external clock signal injected on
  *        LPTIM_IN1 or configured in Encoder mode, it is possible to
  *        select the source connected to Input1.
  *        (@ref HAL_LPTIM_SetInput1Source()).
  */
typedef enum
{
  HAL_LPTIM_INPUT1_GPIO  = LL_LPTIM_INPUT1_SRC_GPIO,

  HAL_LPTIM_INPUT1_COMP1_OUT = LL_LPTIM_INPUT1_SRC_COMP1_OUT,

} hal_lptim_input1_src_t;


/**
  * @brief HAL LPTIM Input2 source definition. \n
  *        When LPTIM is configured in Encoder mode, it is possible to select the source connected to Input2 using \n
  *        the function that configures the encoder (@ref HAL_LPTIM_SetConfigEncoder()).
  */
typedef enum
{
  HAL_LPTIM_INPUT2_GPIO  = LL_LPTIM_INPUT2_SRC_GPIO,
#if defined(COMP2)

  HAL_LPTIM_INPUT2_COMP2_OUT  = LL_LPTIM_INPUT2_SRC_COMP2_OUT,
#endif /* COMP2 */
} hal_lptim_input2_src_t;


/**
  * @brief HAL LPTIM Clock Source selection.
  */
typedef enum
{
  /*---------------------------------------- Internal clock source ---------------------------------------------------*/
  /** LPTIM is clocked by an internal clock source (APB clock or any of the
  embedded oscillators). \n
  The counter is incremented following each internal clock pulse.
  */
  HAL_LPTIM_CLK_INTERNAL = (LL_LPTIM_CLK_SOURCE_INTERNAL |
                            LL_LPTIM_COUNTER_MODE_INTERNAL),

  /*------------------------------------- External clock source with internal clock --------------------------------- */
  /** The LPTIM external Input1 is sampled with the internal clock (APB clock
   or any of the embedded oscillators) provided to the LPTIM. \n
   It is possible to configure the external clock source (Input1 signal
   conditioning) through dedicated functions:
                      - @ref HAL_LPTIM_SetConfigInput1()
                      - @ref HAL_LPTIM_SetInput1Source()
                      - @ref HAL_LPTIM_SetInput1Polarity()
                      - @ref HAL_LPTIM_SetInput1Filter()
  */
  HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS = (LL_LPTIM_CLK_SOURCE_INTERNAL |
                                        LL_LPTIM_COUNTER_MODE_EXTERNAL),

  /*------------------------------------- External clock source only ------------------------------------------------ */
  /** The signal injected on the LPTIM external Input1 is used as the system clock for the LPTIM. \n
   It is possible to configure the external clock source (Input1 signal
   conditioning) through dedicated functions:
                      - @ref HAL_LPTIM_SetConfigInput1()
                      - @ref HAL_LPTIM_SetInput1Source()
                      - @ref HAL_LPTIM_SetInput1Polarity()
                      - @ref HAL_LPTIM_SetInput1Filter()
     @note If the polarity is configured on 'both edges', or if filtering is
       used, an auxiliary clock (one of the low-power oscillators) must be active.
  */
  HAL_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS = LL_LPTIM_CLK_SOURCE_EXTERNAL,

