MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.h
  /*-------------------------------------------------- Encoder mode ------------------------------------------------- */
  /* LPTIM is in encoder mode. It is clocked by internal clock source with   */
  /* prescaler division ratio at 1 (reset value).                            */
  /* The clock signal for the counter is generated from the two external     */
  /* inputs (Input1 and Input2).                                             */
  /* The signal frequency on both Input1 and Input2 inputs must not exceed  */
  /* the LPTIM internal clock frequency divided by 4.                        */
  /* It is possible to configure the Input1 and Input2 conditioning     */
  /* through a dedicated function @ref HAL_LPTIM_SetConfigEncoder(). */

  /** Quadrature encoder sub-mode 1: rising edge is the active edge.

      Count Down when:
      - a rising edge on Input1 when Input2 is high
      - a rising edge on Input2 when Input1 is low

      Count Up when:
      - a rising edge on Input1 when Input2 is low
      - a rising edge on Input2 when Input1 is high
   */
  HAL_LPTIM_CLK_ENCODER_SUBMODE_1 = (LL_LPTIM_CLK_SOURCE_INTERNAL |
                                     LL_LPTIM_ENCODER_MODE_RISING |
                                     LL_LPTIM_ENCODER_MODE_ENABLE),

  /** Quadrature encoder sub-mode 2: falling edge is the active edge.

      Count Down when:
      - a falling edge on Input1 when Input2 is low
      - a falling edge on Input2 when Input1 is high

      Count Up when:
      - a falling edge on Input1 when Input2 is high
      - a falling edge on Input2 when Input1 is low
  */
  HAL_LPTIM_CLK_ENCODER_SUBMODE_2 = (LL_LPTIM_CLK_SOURCE_INTERNAL |
                                     LL_LPTIM_ENCODER_MODE_FALLING |
                                     LL_LPTIM_ENCODER_MODE_ENABLE),

  /** Quadrature encoder sub-mode 3: both edges are active.

      Count Down with:
      - a rising edge on Input1 when Input2 is high
      - a rising edge on Input2 when Input1 is low
      - a falling edge on Input1 when Input2 is low
      - a falling edge on Input2 when Input1 is high

      Count Up with:
      - a rising edge on Input1 when Input2 is low
      - a rising edge on Input2 when Input1 is high
      - a falling edge on Input1 when Input2 is high
      - a falling edge on Input2 when Input1 is low
  */
  HAL_LPTIM_CLK_ENCODER_SUBMODE_3 = (LL_LPTIM_CLK_SOURCE_INTERNAL |
                                     LL_LPTIM_ENCODER_MODE_RISING_FALLING |
                                     LL_LPTIM_ENCODER_MODE_ENABLE),

} hal_lptim_clk_src_t;

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
/**
  *  @brief LPTIM DMA Handle Index.
  */
typedef enum
{
  /** Index of the DMA handle used for Update DMA requests                 */
  HAL_LPTIM_DMA_ID_UPDATE      = 0x0U,

  /** Index of the DMA handle used for input capture event 1 DMA requests */
  HAL_LPTIM_DMA_ID_CC1         = 0x1U,

  /** Index of the DMA handle used for input capture event 2 DMA requests */
  HAL_LPTIM_DMA_ID_CC2         = 0x2U,

} hal_lptim_dma_index_t;
#endif /* USE_HAL_LPTIM_DMA */

/**
  * @brief HAL LPTIM External Trigger Selection.
  */
typedef enum
{
  /** External input trigger is connected to TIMx_ETR input */
  HAL_LPTIM_EXT_TRIG_GPIO,

  /** External input trigger is connected to RTC Alarm A    */
  HAL_LPTIM_EXT_TRIG_RTC_ALRA_TRG,

  /** External input trigger is connected to RTC Alarm B    */
  HAL_LPTIM_EXT_TRIG_RTC_ALRB_TRG,

  /** External input trigger is connected to RTC Tamper 1   */
  HAL_LPTIM_EXT_TRIG_TAMP_TRG1,

  /** External input trigger is connected to RTC Tamper 2   */
  HAL_LPTIM_EXT_TRIG_TAMP_TRG2,

  /** External input trigger is connected to GPDMA CH1 transfer complete */
  HAL_LPTIM_EXT_TRIG_LPDMA_CH1_TC,

  /** External input trigger is connected to COMP1 output   */
  HAL_LPTIM_EXT_TRIG_COMP1_OUT,

  /** External input trigger is connected to EventOUT   */
  HAL_LPTIM_EXT_TRIG_EVENTOUT,
} hal_lptim_ext_trig_src_t;


/**
  * @brief HAL LPTIM External Trigger Polarity.
  */
typedef enum
{
  /** LPTIM counter starts when a rising edge is detected  */
  HAL_LPTIM_TRIG_RISING = LL_LPTIM_TRIG_POLARITY_RISING,

  /** LPTIM counter starts when a falling edge is detected */
  HAL_LPTIM_TRIG_FALLING = LL_LPTIM_TRIG_POLARITY_FALLING,

  /** LPTIM counter starts when a rising or a falling edge is detected */
  HAL_LPTIM_TRIG_RISING_FALLING = LL_LPTIM_TRIG_POLARITY_RISING_FALLING,

} hal_lptim_ext_trig_polarity_t;

/**
  * @brief HAL LPTIM Digital Filter definition.
  *        The LPTIM inputs, either external (connected to GPIOs) or internal
  *        (connected to other built-in peripherals), are
  *        protected by digital filters that prevent glitches and noise
  *        perturbations from propagating inside the LPTIM.
  *
  *        The digital filters are divided into three groups:
  *        - The first group of digital filters protects the LPTIM internal or
  *          external inputs. The digital filter sensitivity is controlled by
  *          the CKFLT bits,
  *        - The second group of digital filters protects the LPTIM internal or
  *          external trigger inputs. The digital filter sensitivity is
  *          controlled by the TRGFLT bits.
  *        - The third group of digital filters protects the LPTIM internal or
  *          external input captures. The digital filter sensitivity is
  *          controlled by the ICxF bits.
  * @note  Internal clock signal must be provided to the LPTIM.
  */
typedef enum
{
  /** No filter                                          */
  HAL_LPTIM_FDIV1    = 0x0U,

  /** Active level change must be stable for at least
    2 clock periods before it is considered a valid level. */
  HAL_LPTIM_FDIV1_N2 = 0x1U,

  /** Active level change must be stable for at least
    4 clock periods before it is considered a valid level. */
  HAL_LPTIM_FDIV1_N4 = 0x2U,

  /** Active level change must be stable for at least
    8 clock periods before it is considered valid. */
  HAL_LPTIM_FDIV1_N8 = 0x3U,

} hal_lptim_filter_t;


/**
  * @brief HAL LPTIM Preload Status.
  *        When preload is enabled, the update of the autoreload and repetition counter
  *        of the compare values is done at the end of the current period.
  * @note  If the repetition counter is used, preload must be enabled; otherwise,
  *        unpredictable behavior can occur.
  */
typedef enum
{
  /** LPTIMx ARR/RCR/CCRx registers are not preloaded.
      Registers are updated after each APB bus write access. */
  HAL_LPTIM_PRELOAD_DISABLED = LL_LPTIM_PRELOAD_DISABLED,

  /** LPTIMx ARR/RCR/CCRx registers are preloaded.
      Registers are updated at next LPTIM update event, if the
      timer has been already started. */
  HAL_LPTIM_PRELOAD_ENABLED  = LL_LPTIM_PRELOAD_ENABLED,

