MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.h
} hal_lptim_preload_status_t;

/**
  * @brief HAL LPTIM Reset counter after read Status.
  *        When reset counter after read is enabled, the counter is reset after each
  *        @ref HAL_LPTIM_GetCounter call.
  */
typedef enum
{
  HAL_LPTIM_RESET_AFTER_READ_DISABLED = 0U,

  HAL_LPTIM_RESET_AFTER_READ_ENABLED  = 1U,

} hal_lptim_reset_after_read_status_t;


/**
  * @brief HAL LPTIM Output Channel Polarity.
  */
typedef enum
{
  /** Output Channel active high. The LPTIM output reflects the compare
      results between LPTIM_ARR and LPTIM_CCRx registers.                 */
  HAL_LPTIM_OC_HIGH = LL_LPTIM_OCPOLARITY_HIGH,

  /** Output Channel active low. The LPTIM output reflects the inverse
      of the compare results between LPTIMx_ARR and LPTIMx_CCx registers. */
  HAL_LPTIM_OC_LOW  = LL_LPTIM_OCPOLARITY_LOW,

} hal_lptim_oc_polarity_t;


/**
  * @brief HAL LPTIM Input Channel Polarity.
  */
typedef enum
{
  /** Rising edges are detected on the input channel.             */
  HAL_LPTIM_IC_RISING         = LL_LPTIM_ICPOLARITY_RISING,

  /** Falling edges are detected on the input channel.            */
  HAL_LPTIM_IC_FALLING        = LL_LPTIM_ICPOLARITY_FALLING,

  /** Both rising and falling edges are detected on the input channel. */
  HAL_LPTIM_IC_RISING_FALLING = LL_LPTIM_ICPOLARITY_RISING_FALLING,

} hal_lptim_ic_polarity_t;


/**
  * @brief HAL LPTIM Input Channel Prescaler.
  */
typedef enum
{
  /** Capture is performed each time an edge is detected on the input channel. */
  HAL_LPTIM_IC_DIV1 = LL_LPTIM_ICPSC_DIV1,

  /** Capture is performed once every 2 events.                             */
  HAL_LPTIM_IC_DIV2 = LL_LPTIM_ICPSC_DIV2,

  /** Capture is performed once every 4 events.                             */
  HAL_LPTIM_IC_DIV4 = LL_LPTIM_ICPSC_DIV4,

  /** Capture is performed once every 8 events.                             */
  HAL_LPTIM_IC_DIV8 = LL_LPTIM_ICPSC_DIV8,

} hal_lptim_ic_prescaler_t;

/**
  * @}
  */

/** @defgroup LPTIM_Exported_Types_Group2 Structures
  * @{
 */

/**
  * @brief HAL LPTIM time-base handle type declaration.
  */
struct hal_lptim_handle_s;
/**
  * @brief Typedef for HAL LPTIM time-base handle type declaration.
  */
typedef struct hal_lptim_handle_s hal_lptim_handle_t;

/*
 * Type definitions for the callbacks
 */
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
/** HAL LPTIM generic callback pointer definition */
typedef void (* hal_lptim_cb_t)(hal_lptim_handle_t *);
/** HAL LPTIM callback pointer definition with channel parameter */
typedef void (* hal_lptim_channel_cb_t)(hal_lptim_handle_t *, hal_lptim_channel_t);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */


/**
  * @brief HAL LPTIM time-base handle structure definition.
  */
struct hal_lptim_handle_s
{
  /** HAL LPTIM instance */
  hal_lptim_t instance;

  /** LPTIM mode */
  hal_lptim_mode_t mode;

  /** LPTIM global state */
  volatile hal_lptim_state_t global_state;

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
  /** DMA handlers array. (Handlers can be indexed with @ref hal_lptim_dma_index_t) */
  hal_dma_handle_t *hdma[LPTIM_DMA_REQUESTS];
#endif /* USE_HAL_LPTIM_DMA */

  /** LPTIM channels state array */
  volatile hal_lptim_channel_state_t channel_states[HAL_LPTIM_CHANNELS];

#if defined(USE_HAL_LPTIM_USER_DATA) && (USE_HAL_LPTIM_USER_DATA == 1)
  /** User data pointer. */
  const void *p_user_data;
#endif /* USE_HAL_LPTIM_USER_DATA */

#if defined (USE_HAL_LPTIM_GET_LAST_ERRORS) && (USE_HAL_LPTIM_GET_LAST_ERRORS == 1)
  /**
    * @brief Store last error codes.
    */
  volatile uint32_t last_error_codes;
#endif /* USE_HAL_LPTIM_GET_LAST_ERRORS */

#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
  /** LPTIM Error callback */
  hal_lptim_cb_t error_callback;

  /** LPTIM Update DMA stop callback */
  hal_lptim_cb_t stop_callback;

  /** LPTIM capture/compare DMA stop callback */
  hal_lptim_channel_cb_t input_capture_stop_callback;
#endif /* USE_HAL_LPTIM_DMA */

  /** LPTIM Update callback */
  hal_lptim_cb_t update_callback;

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
  /** LPTIM update half-complete callback. */
  hal_lptim_cb_t update_half_cplt_callback;
#endif /* USE_HAL_LPTIM_DMA */

  /** LPTIM auto-reload update callback */
  hal_lptim_cb_t auto_reload_update_callback;

  /** LPTIM auto-reload match callback */
  hal_lptim_cb_t auto_reload_match_callback;

  /** LPTIM repetition update callback */
  hal_lptim_cb_t rep_update_callback;

  /** LPTIM Trigger callback */
  hal_lptim_cb_t trigger_callback;

  /** LPTIM Compare Match callback */
  hal_lptim_channel_cb_t compare_match_callback;

  /** LPTIM Compare Update callback */
  hal_lptim_channel_cb_t compare_update_callback;

  /** LPTIM Input Capture callback */
  hal_lptim_channel_cb_t input_capture_callback;

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
  /** LPTIM Input Capture Half Complete callback */
  hal_lptim_channel_cb_t input_capture_half_cplt_callback;
#endif /* USE_HAL_LPTIM_DMA */

  /** Over-capture callback */
  hal_lptim_channel_cb_t input_over_capture_callback;

  /** LPTIM Direction up change callback */
  hal_lptim_cb_t direction_up_callback;

  /** LPTIM Direction down change callback */
  hal_lptim_cb_t direction_down_callback;

#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
};


/**
  * @brief HAL LPTIM Input1 configuration structure definition.
  *
  */
typedef struct
{
  /** Select the source connected to Input1. */
  hal_lptim_input1_src_t src;

  /** Select the active edge(s) of the signal. */
  hal_lptim_input1_polarity_t polarity;

  /** Select a digital filter protection. */
  hal_lptim_filter_t filter;

} hal_lptim_input1_config_t;


/**
  * @brief  LPTIM input channel configuration structure definition.
  */
typedef struct
{
  /** Specify source selected for IC channel.      */
  hal_lptim_ic_src_t source;

  /** Specify the active edge of the input signal. */
  hal_lptim_ic_polarity_t polarity;

  /** Specify the input channel filter.            */
  hal_lptim_filter_t filter;

