MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.h
  /** Specify the input channel prescaler.         */
  hal_lptim_ic_prescaler_t prescaler;

} hal_lptim_ic_config_t;


/**
  * @brief HAL LPTIM output channel configuration.
  */
typedef struct
{
  /** Duration (in clock cycles) of the pulse generated on the output channel. */
  uint32_t pulse;

  /** Polarity of the output channel */
  hal_lptim_oc_polarity_t polarity;

} hal_lptim_oc_config_t;


/**
  * @brief HAL LPTIM external trigger configuration structure definition.
  *
  */
typedef struct
{
  /** Specify the external trigger input source.    */
  hal_lptim_ext_trig_src_t source;

  /** Specify the external trigger input polarity.  */
  hal_lptim_ext_trig_polarity_t polarity;

  /** Specify the external trigger input filter (Trigger Sample Time).    */
  hal_lptim_filter_t filter;

} hal_lptim_ext_trig_config_t;


/**
  * @brief HAL LPTIM encoder configuration structure definition.
  *
  * When the low-power timer (LPTIM) is configured in encoder mode, it operates as follows:
  *     - External Input Signals: The LPTIM uses two external input signals, referred to as Input1 and Input2.
  *     - Clock Signal Generation: These input signals generate a clock signal that is used to clock the
  *         LPTIM counter. The clock source is specified by the parameter HAL_LPTIM_CLK_ENCODER_SUBMODE_[1|2|3].
  *     - Quadrature Encoder Signals: The two signals from quadrature encoders can be filtered to ensure
  *         accurate counting and noise reduction.
  */
typedef struct
{
  /** Selection of the first input of the encoder. */
  hal_lptim_input1_src_t input1;

  /** Selection of the second input of the encoder. */
  hal_lptim_input2_src_t input2;

  /** Filter for the encoder inputs.
      @note The digital filter sensitivity is controlled by groups.
            Therefore, it is not possible to configure each digital
        filter sensitivity separately for Input1 and Input2. */
  hal_lptim_filter_t filter;

} hal_lptim_encoder_config_t;


/**
  * @brief HAL LPTIM time-base configuration structure definition.
  */
typedef struct
{
  /** Clock selection.\n
      Specify the source of the clock feeding the timer's prescaler. */
  hal_lptim_clk_src_t clock_source;

  /** Counter mode selection.\n
      Specify how the counter counts. */
  hal_lptim_mode_t mode;

  /** Specify the prescaler value used to divide the LPTIM clock.\n
      This parameter is valid only if the clock is either
      HAL_LPTIM_CLK_INTERNAL or HAL_LPTIM_CLK_EXTERNAL_ASYNCHRONOUS
      (for the latter, it has no effect).\n
      When the clock is HAL_LPTIM_CLK_EXTERNAL_SYNCHRONOUS the prescaler division factor
      is set to 1.
      In encoder mode (HAL_LPTIM_CLK_ENCODER_SUBMODE_[1|2|3]) the prescaler
      division factor is set to 1. */
  hal_lptim_clk_src_presc_t prescaler;

  /** Specify the period value to be loaded into the active
    auto-reload register.\n
    This parameter can be a number between Min_Data = 0x0000
    and Max_Data = 0xFFFF. */
  uint32_t period;

  /** Specify the repetition counter value.\n
      If the repetition counter is used, the update event (UEV) is generated
      after upcounting is repeated for the number of times programmed in the
      repetition counter register (RCR).\n
      Otherwise, the update event is generated at each counter overflow.
      This parameter must be a number between Min_Data = 0x00 and
      Max_Data = 0xFF.
      @warning When using the repetition counter with PRELOAD = 0, the LPTIM_RCR register
        must be changed at least five counter cycles before the autoreload
        match event; otherwise, unpredictable behavior can occur.
            Therefore, it is strongly advised to enable preload in order to
        avoid unpredictable behavior when using the repetition counter. */
  uint32_t repetition_counter;

  /**
      @note Counter trigger selection.
      One external trigger input (LPTIM_ETR) that can be connected to up to 8 different sources.
      After reset or a counter stop, the software trigger is enabled (TRIGEN == 00).
      To enable an external trigger, HAL_LPTIM_SetConfigExtTrigInput()
      must be called to configure the external trigger.
  */

} hal_lptim_config_t;
/**
  * @}
  */

/**
  * @}
  */
/* End of exported types ---------------------------------------------------------------------------------------------*/


/* Exported functions ------------------------------------------------------------------------------------------------*/

/** @defgroup LPTIM_Exported_Functions HAL LPTIM Functions
  *  @{
  */

/** @defgroup LPTIM_Exported_Functions_Group1 LP Timer Initialization/Deinitialization function
  *  @{
  */
hal_status_t HAL_LPTIM_Init(hal_lptim_handle_t *hlptim, hal_lptim_t instance);
void HAL_LPTIM_DeInit(hal_lptim_handle_t *hlptim);
#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
hal_status_t HAL_LPTIM_SetDMA(hal_lptim_handle_t *hlptim,
                              hal_lptim_dma_index_t dma_idx,
                              hal_dma_handle_t *hdma);
#endif /* USE_HAL_LPTIM_DMA */

/**
  * @}
  */


/** @defgroup LPTIM_Exported_Functions_Group2 LP Timer Peripheral State, Error functions
  *           This group gathers the functions for the states and error management.
  *  @{
  */
hal_lptim_state_t HAL_LPTIM_GetState(const hal_lptim_handle_t *hlptim);

hal_lptim_channel_state_t HAL_LPTIM_GetChannelState(const hal_lptim_handle_t *hlptim,
                                                    hal_lptim_channel_t channel);

#if defined (USE_HAL_LPTIM_GET_LAST_ERRORS) && (USE_HAL_LPTIM_GET_LAST_ERRORS == 1)

uint32_t HAL_LPTIM_GetLastErrorCodes(const hal_lptim_handle_t *hlptim);

#endif /* USE_HAL_LPTIM_GET_LAST_ERRORS */
/**
  *  @}
  */


/** @defgroup LPTIM_Exported_Functions_Group3 LP Timer Timebase configuration and control.
  *  @{
  */
hal_status_t HAL_LPTIM_SetConfig(hal_lptim_handle_t *hlptim,
                                 const hal_lptim_config_t *p_config);
void HAL_LPTIM_GetConfig(const hal_lptim_handle_t *hlptim,
                         hal_lptim_config_t *p_config);

hal_status_t HAL_LPTIM_SetMode(hal_lptim_handle_t *hlptim,
                               hal_lptim_mode_t mode);
hal_lptim_mode_t HAL_LPTIM_GetMode(const hal_lptim_handle_t *hlptim);

hal_status_t HAL_LPTIM_SetClockSource(const hal_lptim_handle_t *hlptim,
                                      hal_lptim_clk_src_t clk_src);
hal_lptim_clk_src_t HAL_LPTIM_GetClockSource(const hal_lptim_handle_t *hlptim);

