MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_lptim.h
hal_status_t HAL_LPTIM_IC_StartChannel(hal_lptim_handle_t *hlptim,
                                       hal_lptim_channel_t channel);
hal_status_t HAL_LPTIM_IC_StopChannel(hal_lptim_handle_t *hlptim,
                                      hal_lptim_channel_t channel);

hal_status_t HAL_LPTIM_IC_StartChannel_IT(hal_lptim_handle_t *hlptim,
                                          hal_lptim_channel_t channel);
hal_status_t HAL_LPTIM_IC_StopChannel_IT(hal_lptim_handle_t *hlptim,
                                         hal_lptim_channel_t channel);

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
hal_status_t HAL_LPTIM_IC_StartChannel_DMA(hal_lptim_handle_t *hlptim,
                                           hal_lptim_channel_t channel,
                                           uint8_t *p_data,
                                           uint32_t size_byte);
hal_status_t HAL_LPTIM_IC_StartChannel_DMA_Opt(hal_lptim_handle_t *hlptim,
                                               hal_lptim_channel_t channel,
                                               uint8_t *p_data,
                                               uint32_t size_byte,
                                               uint32_t interrupts);
hal_status_t HAL_LPTIM_IC_StopChannel_DMA(hal_lptim_handle_t *hlptim,
                                          hal_lptim_channel_t channel);
#endif /* USE_HAL_LPTIM_DMA */

uint32_t HAL_LPTIM_IC_ReadChannelCapturedValue(const hal_lptim_handle_t *hlptim,
                                               hal_lptim_channel_t channel);

uint8_t HAL_LPTIM_IC_GetChannelFilterLatency(const hal_lptim_handle_t *hlptim,
                                             hal_lptim_channel_t channel);

/**
  * @}
  */


/** @defgroup LPTIM_Exported_Functions_Group7 Low-power timer encoder functions.
  *  @{
  *
  */
hal_status_t HAL_LPTIM_SetConfigEncoder(const hal_lptim_handle_t *hlptim,
                                        const hal_lptim_encoder_config_t *p_encoder);
void HAL_LPTIM_GetConfigEncoder(const hal_lptim_handle_t *hlptim,
                                hal_lptim_encoder_config_t *p_encoder);

/**
  *  @}
  */


/**
  * @defgroup LPTIM_Exported_Functions_Group8 Config external trigger
  *
  * @{
  *
  */
hal_status_t HAL_LPTIM_SetConfigExtTrigInput(const hal_lptim_handle_t *hlptim,
                                             const hal_lptim_ext_trig_config_t *p_config);
void HAL_LPTIM_GetConfigExtTrigInput(const hal_lptim_handle_t *hlptim,
                                     hal_lptim_ext_trig_config_t *p_config);

hal_status_t HAL_LPTIM_SetExtTrigInputSource(const hal_lptim_handle_t *hlptim,
                                             hal_lptim_ext_trig_src_t source);
hal_lptim_ext_trig_src_t HAL_LPTIM_GetExtTrigInputSource(const hal_lptim_handle_t *hlptim);

hal_status_t HAL_LPTIM_SetExtTrigInputPolarity(const hal_lptim_handle_t *hlptim,
                                               hal_lptim_ext_trig_polarity_t polarity);
hal_lptim_ext_trig_polarity_t HAL_LPTIM_GetExtTrigInputPolarity(const hal_lptim_handle_t *hlptim);

hal_status_t HAL_LPTIM_SetExtTrigInputFilter(const hal_lptim_handle_t *hlptim,
                                             hal_lptim_filter_t filter);
hal_lptim_filter_t HAL_LPTIM_GetExtTrigInputFilter(const hal_lptim_handle_t *hlptim);
/**
  *  @}
  */


/** @defgroup LPTIM_Exported_Functions_Group9 Low-power timer IRQ handler and callback functions
  *  @{
  */

/* Interrupt Handler functions   **************************************************************************************/
void HAL_LPTIM_IRQHandler(hal_lptim_handle_t *hlptim);
void HAL_LPTIM_UPD_IRQHandler(hal_lptim_handle_t *hlptim);
void HAL_LPTIM_CC_IRQHandler(hal_lptim_handle_t *hlptim);
void HAL_LPTIM_TRGI_DIR_IRQHandler(hal_lptim_handle_t *hlptim);

/* Declaration for the weak callbacks *********************************************************************************/
#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
void HAL_LPTIM_ErrorCallback(hal_lptim_handle_t *hlptim);
void HAL_LPTIM_StopCallback(hal_lptim_handle_t *hlptim);
void HAL_LPTIM_InputCaptureStopCallback(hal_lptim_handle_t *hlptim,
                                        hal_lptim_channel_t channel);
#endif /* USE_HAL_LPTIM_DMA */

void HAL_LPTIM_UpdateCallback(hal_lptim_handle_t *hlptim);

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
void HAL_LPTIM_UpdateHalfCpltCallback(hal_lptim_handle_t *hlptim);
#endif /* USE_HAL_LPTIM_DMA */

void HAL_LPTIM_RepUpdateCallback(hal_lptim_handle_t *hlptim);

void HAL_LPTIM_TriggerCallback(hal_lptim_handle_t *hlptim);

void HAL_LPTIM_InputCaptureCallback(hal_lptim_handle_t *hlptim,
                                    hal_lptim_channel_t channel);

#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
void HAL_LPTIM_InputCaptureHalfCpltCallback(hal_lptim_handle_t *hlptim,
                                            hal_lptim_channel_t channel);
#endif /* USE_HAL_LPTIM_DMA */

void HAL_LPTIM_InputOverCaptureCallback(hal_lptim_handle_t *hlptim,
                                        hal_lptim_channel_t channel);

void HAL_LPTIM_CompareMatchCallback(hal_lptim_handle_t *hlptim,
                                    hal_lptim_channel_t channel);

void HAL_LPTIM_CompareUpdateCallback(hal_lptim_handle_t *hlptim,
                                     hal_lptim_channel_t channel);

void HAL_LPTIM_AutoReloadMatchCallback(hal_lptim_handle_t *hlptim);

void HAL_LPTIM_AutoReloadUpdateCallback(hal_lptim_handle_t *hlptim);

void HAL_LPTIM_DirectionUpCallback(hal_lptim_handle_t *hlptim);

void HAL_LPTIM_DirectionDownCallback(hal_lptim_handle_t *hlptim);

/* Interfaces for registering callbacks *******************************************************************************/
#if defined(USE_HAL_LPTIM_REGISTER_CALLBACKS) && (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
hal_status_t HAL_LPTIM_RegisterStopCallback(hal_lptim_handle_t *hlptim,
                                            hal_lptim_cb_t fct);
hal_status_t HAL_LPTIM_RegisterChannelStopCallback(hal_lptim_handle_t *hlptim,
                                                   hal_lptim_channel_cb_t fct);
hal_status_t HAL_LPTIM_RegisterErrorCallback(hal_lptim_handle_t *hlptim,
                                             hal_lptim_cb_t fct);
hal_status_t HAL_LPTIM_RegisterUpdateCallback(hal_lptim_handle_t *hlptim,
                                              hal_lptim_cb_t fct);
#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
hal_status_t HAL_LPTIM_RegisterUpdateHalfCpltCallback(hal_lptim_handle_t *hlptim,
                                                      hal_lptim_cb_t fct);
#endif /* USE_HAL_LPTIM_DMA */
hal_status_t HAL_LPTIM_RegisterRepUpdateCallback(hal_lptim_handle_t *hlptim,
                                                 hal_lptim_cb_t fct);
hal_status_t HAL_LPTIM_RegisterTriggerCallback(hal_lptim_handle_t *hlptim,
                                               hal_lptim_cb_t fct);
hal_status_t HAL_LPTIM_RegisterInputCaptureCallback(hal_lptim_handle_t *hlptim,
                                                    hal_lptim_channel_cb_t fct);
#if defined(USE_HAL_LPTIM_DMA) && (USE_HAL_LPTIM_DMA == 1)
hal_status_t HAL_LPTIM_RegisterInputCaptureHalfCpltCallback(hal_lptim_handle_t *hlptim,
                                                            hal_lptim_channel_cb_t fct);
#endif /* USE_HAL_LPTIM_DMA */
hal_status_t HAL_LPTIM_RegisterOverCaptureCallback(hal_lptim_handle_t *hlptim,
                                                   hal_lptim_channel_cb_t fct);
hal_status_t HAL_LPTIM_RegisterCompareMatchCallback(hal_lptim_handle_t *hlptim,
                                                    hal_lptim_channel_cb_t fct);
hal_status_t HAL_LPTIM_RegisterCompareUpdateCallback(hal_lptim_handle_t *hlptim,
                                                     hal_lptim_channel_cb_t fct);
hal_status_t HAL_LPTIM_RegisterAutoReloadUpdateCallback(hal_lptim_handle_t *hlptim,
                                                        hal_lptim_cb_t fct);
hal_status_t HAL_LPTIM_RegisterAutoReloadMatchCallback(hal_lptim_handle_t *hlptim,
                                                       hal_lptim_cb_t fct);
hal_status_t HAL_LPTIM_RegisterDirectionUpCallback(hal_lptim_handle_t *hlptim,
                                                   hal_lptim_cb_t fct);
hal_status_t HAL_LPTIM_RegisterDirectionDownCallback(hal_lptim_handle_t *hlptim,
                                                     hal_lptim_cb_t fct);

#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
/**
  *  @}
  */

#if defined (USE_HAL_LPTIM_USER_DATA) && (USE_HAL_LPTIM_USER_DATA == 1)
/** @defgroup LPTIM_Exported_Functions_Group10 Low-power timer user data setter and getter.
  *  @{
  */
void HAL_LPTIM_SetUserData(hal_lptim_handle_t *hlptim, const void *p_user_data);
const void *HAL_LPTIM_GetUserData(const hal_lptim_handle_t *hlptim);

/**
  *  @}
  */
#endif /* USE_HAL_LPTIM_USER_DATA */


/** @defgroup LPTIM_Exported_Functions_Group11 Peripheral clock frequency for LPTIMx
  *  @{
  */
uint32_t HAL_LPTIM_GetClockFreq(const hal_lptim_handle_t *hlptim);
/**
  *  @}
  */

/**
  * @}
  */
/* End of exported functions -----------------------------------------------------------------------------------------*/

/**
  *  @}
  */

#endif /* LPTIM1 */
/**
  *  @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32C5xx_HAL_LPTIM_H */
